### 4. 데이터프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [2]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [3]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [4]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습문제 4.4.1

In [6]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [7]:
# 열 별로 인덱싱해서 세기
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [8]:
titanic['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

- 정렬

In [9]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40, 101, size=(4, 5)), index=list('abcd'), columns=list('VWXYZ'))
df['V']['c'] = df['V']['b']
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

In [10]:
df.sort_values(by='V')

    V   W    X   Y   Z
d  59  97   71  42  56
b  73  98  100  43  45
c  73  44   86  46  71
a  83  91   79  78  82

In [11]:
# V열에 동일한 값이 있으면, 동일한 값은 W열을 보고 정렬
df2 = df.sort_values(by=['V', 'W'])
df2

    V   W    X   Y   Z
d  59  97   71  42  56
c  73  44   86  46  71
b  73  98  100  43  45
a  83  91   79  78  82

In [12]:
df2.sort_index()

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

- 연습문제 4.4.2
    - sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수,
    - 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [13]:
print(titanic.value_counts('sex'))
print(titanic.value_counts('class'))
print(titanic.value_counts('alive'))

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행/열 합계

In [14]:
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  73  44   86  46  71
d  59  97   71  42  56

In [15]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    288
W    330
X    336
Y    209
Z    254
dtype: int64

In [16]:
# 열 방향(행의 합계)
df.sum(axis=1)

a    413
b    359
c    320
d    325
dtype: int64

In [17]:
# 총점 열
df['총점'] = df.sum(axis=1)
df

    V   W    X   Y   Z   총점
a  83  91   79  78  82  413
b  73  98  100  43  45  359
c  73  44   86  46  71  320
d  59  97   71  42  56  325

In [18]:
# 평균
df['평균'] = df.iloc[:, :5].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균
a  83  91   79  78  82  413  82.6
b  73  98  100  43  45  359  71.8
c  73  44   86  46  71  320  64.0
d  59  97   71  42  56  325  65.0

In [19]:
# 행 추가 방법
df.loc['합계', :] = df.sum()
df

        V      W      X      Y      Z      총점     평균
a    83.0   91.0   79.0   78.0   82.0   413.0   82.6
b    73.0   98.0  100.0   43.0   45.0   359.0   71.8
c    73.0   44.0   86.0   46.0   71.0   320.0   64.0
d    59.0   97.0   71.0   42.0   56.0   325.0   65.0
합계  288.0  330.0  336.0  209.0  254.0  1417.0  283.4

- 연습 문제 4.4.3
    - 타이타닉호 승객의 평균 나이를 구하라.
    - 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
    - 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [20]:
titanic['age'].sum(axis=0) / titanic['age'].count()

29.69911764705882

In [21]:
a = titanic['sex'] == 'female'
(titanic.age[a]).mean().round(2)

27.92

In [22]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
b = titanic['class'] == 'First'
(titanic.age[a * b]).mean().round(2)

34.61

- apply 변환

In [24]:
df2

    V   W    X   Y   Z
d  59  97   71  42  56
c  73  44   86  46  71
b  73  98  100  43  45
a  83  91   79  78  82

In [25]:
# 각 열에서 최댓값 - 최솟값 연산 결과
df2.apply(lambda x :x.max() - x.min())      # 람다 함수의 x는 각 컬럼을 의미

V    24
W    54
X    29
Y    36
Z    37
dtype: int32

In [26]:
# V열인덱싱에 제곱 값 대치
df2['V'].apply(lambda x: x**2)              # x는 V열의 원소를 의미

d    3481
c    5329
b    5329
a    6889
Name: V, dtype: int64

In [27]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열 만들기
titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x > 20 else 'child')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [28]:
data = {
    'price' : ['1,200', '2,500', '3,300'],
    'text' : ['03.입출력.ipynb', '04.고급인덱싱.ipynb', '05.데이터조작.ipynb']
    }
df3 = pd.DataFrame(data)
df3

   price            text
0  1,200    03.입출력.ipynb
1  2,500  04.고급인덱싱.ipynb
2  3,300  05.데이터조작.ipynb

In [29]:
df3['정수'] = df3.price.apply(lambda x: int(x.replace(',', '')))
df3

   price            text    정수
0  1,200    03.입출력.ipynb  1200
1  2,500  04.고급인덱싱.ipynb  2500
2  3,300  05.데이터조작.ipynb  3300

In [30]:
import string, re
df3['한글제거'] = df3.text.apply(lambda x: x.replace('[ㄱ-ㅎㅏ-ㅣ가-힣]', ''))
df3

   price            text    정수            한글제거
0  1,200    03.입출력.ipynb  1200    03.입출력.ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04.고급인덱싱.ipynb
2  3,300  05.데이터조작.ipynb  3300  05.데이터조작.ipynb

- 연습문제 4.4.4
    - 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
    - 20살이 넘으면 성별을 그대로 사용한다.
    - 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [33]:
a = titanic.age > 20
titanic['category1'] = titanic['sex']
titanic['category1'] = titanic.age.apply(lambda x : 'child' if x <= 20)
titanic

SyntaxError: invalid syntax (3754627724.py, line 3)